Revit 2027 API
MEPAnalyticalConnectionType.PressureLoss Property
 The pressure loss of this analytical connection type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PressureLoss { get; set; }
Public Property PressureLoss As Double
	Get
	Set
public:
property double PressureLoss {
	double get ();
	void set (double value);
}
member PressureLoss : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for pressureLoss must be non-negative.
See Also
Reference
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace